morioka/lwip_asp-linux/lwip_asp/asp/target/cq_frk_fm3_gcc/fm3_mb9bxxx.h
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2008-2011 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN
 * 
 *  上記著作権者は，以下の(1)〜(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 * 
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 * 
 */

#ifndef TOPPERS_FM3_MB9BXXX_H
#define TOPPERS_FM3_MB9BXXX_H

#include <sil.h>

/*
 *  システムクロックの定義（発振子周波数4MHz）
 */
#define SystemFrequency	144000000
#define SysFreHCLK		144000000	/* HCLK = MasterClock / 1 */
#define SysFrePCLK0		72000000	/* PCLK0 = HCLK / 2 */
#define SysFrePCLK1		72000000	/* PCLK1 = HCLK / 2 */
#define SysFrePCLK2		72000000	/* PCLK2 = HCLK / 2 */
#define SysFreTPIU		0			/* TPIUCLK : Disable */

#define SYS_CLOCK		(SystemFrequency)

/*
 *  割込み番号の最大値
 */
#define TMAX_INTNO   (16 + 47)

/*
 *  割込み優先度のビット幅
 */
#define TBITW_IPRI     4

/*
 *  割込み優先度ビット幅中のサブ優先度のビット幅
 */
#define TBITW_SUBIPRI  0

/*
 *  割込みベクタ番号定義
 */
#define IRQ_VECTOR_CSV			(16 + 0)
#define IRQ_VECTOR_SWDT			(16 + 1)
#define IRQ_VECTOR_LVD			(16 + 2)
#define IRQ_VECTOR_WFG			(16 + 3)
#define IRQ_VECTOR_EXINT0_7		(16 + 4)
#define IRQ_VECTOR_EXINT8_31	(16 + 5)
#define IRQ_VECTOR_DTIM_QDU		(16 + 6)
#define IRQ_VECTOR_MFS0RX		(16 + 7)
#define IRQ_VECTOR_MFS0TX		(16 + 8)
#define IRQ_VECTOR_MFS1RX		(16 + 9)
#define IRQ_VECTOR_MFS1TX		(16 + 10)
#define IRQ_VECTOR_MFS2RX		(16 + 11)
#define IRQ_VECTOR_MFS2TX		(16 + 12)
#define IRQ_VECTOR_MFS3RX		(16 + 13)
#define IRQ_VECTOR_MFS3TX		(16 + 14)
#define IRQ_VECTOR_MFS4RX		(16 + 15)
#define IRQ_VECTOR_MFS4TX		(16 + 16)
#define IRQ_VECTOR_MFS5RX		(16 + 17)
#define IRQ_VECTOR_MFS5TX		(16 + 18)
#define IRQ_VECTOR_MFS6RX		(16 + 19)
#define IRQ_VECTOR_MFS6TX		(16 + 20)
#define IRQ_VECTOR_MFS7RX		(16 + 21)
#define IRQ_VECTOR_MFS7TX		(16 + 22)
#define IRQ_VECTOR_PPG			(16 + 23)
#define IRQ_VECTOR_OSC_PLL_WC	(16 + 24)
#define IRQ_VECTOR_ADC0	 		(16 + 25)
#define IRQ_VECTOR_ADC1 		(16 + 26)
#define IRQ_VECTOR_ADC2 		(16 + 27)
#define IRQ_VECTOR_FRTIM		(16 + 28)
#define IRQ_VECTOR_INCAP		(16 + 29)
#define IRQ_VECTOR_OUTCOMP		(16 + 30)
#define IRQ_VECTOR_BTIM0_7		(16 + 31)
#define IRQ_VECTOR_CAN0_ETH0 	(16 + 32)
#define IRQ_VECTOR_CAN1_ETH1 	(16 + 33)
#define IRQ_VECTOR_USBF 		(16 + 34)
#define IRQ_VECTOR_USBF_USBH	(16 + 35)
#define IRQ_VECTOR_DMAC0		(16 + 38)
#define IRQ_VECTOR_DMAC1		(16 + 39)
#define IRQ_VECTOR_DMAC2		(16 + 40)
#define IRQ_VECTOR_DMAC3		(16 + 41)
#define IRQ_VECTOR_DMAC4		(16 + 42)
#define IRQ_VECTOR_DMAC5		(16 + 43)
#define IRQ_VECTOR_DMAC6		(16 + 44)
#define IRQ_VECTOR_DMAC7		(16 + 45)
#define IRQ_VECTOR_BTIM8_15		(16 + 46)

#define FM3_PERIPH_BASE			(0x40000000UL)
#define FM3_FLASH_IF_BASE		(FM3_PERIPH_BASE + 0x00000UL)
#define FM3_CRG_BASE			(FM3_PERIPH_BASE + 0x10000UL)
#define FM3_HWWDT_BASE			(FM3_PERIPH_BASE + 0x11000UL)
#define FM3_BT_BASE				(FM3_PERIPH_BASE + 0x25000UL)
#define FM3_ADC0_BASE			(FM3_PERIPH_BASE + 0x27000UL)
#define FM3_ADC1_BASE			(FM3_PERIPH_BASE + 0x27100UL)
#define FM3_ADC2_BASE			(FM3_PERIPH_BASE + 0x27200UL)
#define FM3_CRTRIM_BASE			(FM3_PERIPH_BASE + 0x2E000UL)
#define FM3_EXTI_BASE			(FM3_PERIPH_BASE + 0x30000UL)
#define FM3_INTREQ_BASE			(FM3_PERIPH_BASE + 0x31000UL)
#define FM3_GPIO_BASE			(FM3_PERIPH_BASE + 0x33000UL)
#define FM3_MFS0_UART_BASE		(FM3_PERIPH_BASE + 0x38000UL)
#define FM3_MFS1_UART_BASE		(FM3_PERIPH_BASE + 0x38100UL)
#define FM3_MFS2_UART_BASE		(FM3_PERIPH_BASE + 0x38200UL)
#define FM3_MFS3_UART_BASE		(FM3_PERIPH_BASE + 0x38300UL)
#define FM3_MFS4_UART_BASE		(FM3_PERIPH_BASE + 0x38400UL)
#define FM3_MFS5_UART_BASE		(FM3_PERIPH_BASE + 0x38500UL)
#define FM3_MFS6_UART_BASE		(FM3_PERIPH_BASE + 0x38600UL)
#define FM3_MFS7_UART_BASE		(FM3_PERIPH_BASE + 0x38700UL)
#define FM3_EXTBUS_BASE			(FM3_PERIPH_BASE + 0x3F000UL)
#define FM3_DMAC_BASE			(FM3_PERIPH_BASE + 0x60000UL)

#define BITBAND(a, b)			((volatile uint32_t*)(0x42000000UL + (a - FM3_PERIPH_BASE) * 32 + b * 4))

#define FM3_FLASH_IF_CRTRMM		(FM3_FLASH_IF_BASE + 0x100)

#define FM3_CRG_SCM_CTL			(FM3_CRG_BASE + 0x00)
#define FM3_CRG_SCM_STR			(FM3_CRG_BASE + 0x04)
#define FM3_CRG_STB_CTL			(FM3_CRG_BASE + 0x08)
#define FM3_CRG_RST_STR			(FM3_CRG_BASE + 0x0c)
#define FM3_CRG_BSC_PSR			(FM3_CRG_BASE + 0x10)
#define FM3_CRG_APBC0_PSR		(FM3_CRG_BASE + 0x14)
#define FM3_CRG_APBC1_PSR		(FM3_CRG_BASE + 0x18)
#define FM3_CRG_APBC2_PSR		(FM3_CRG_BASE + 0x1C)
#define FM3_CRG_SWC_PSR			(FM3_CRG_BASE + 0x20)
#define FM3_CRG_TTC_PSR			(FM3_CRG_BASE + 0x28)
#define FM3_CRG_CSW_TMR			(FM3_CRG_BASE + 0x30)
#define FM3_CRG_PSW_TMR			(FM3_CRG_BASE + 0x34)
#define FM3_CRG_PLL_CTL1		(FM3_CRG_BASE + 0x38)
#define FM3_CRG_PLL_CTL2		(FM3_CRG_BASE + 0x3c)
#define FM3_CRG_CSV_CTL			(FM3_CRG_BASE + 0x40)
#define FM3_CRG_CSV_STR			(FM3_CRG_BASE + 0x44)
#define FM3_CRG_FCSWH_CTL		(FM3_CRG_BASE + 0x48)
#define FM3_CRG_FCSWL_CTL		(FM3_CRG_BASE + 0x4C)
#define FM3_CRG_FCSWD_CTL		(FM3_CRG_BASE + 0x50)
#define FM3_CRG_DBWDT_CTL		(FM3_CRG_BASE + 0x54)
#define FM3_CRG_INT_ENR			(FM3_CRG_BASE + 0x60)
#define FM3_CRG_INT_STR			(FM3_CRG_BASE + 0x64)
#define FM3_CRG_INT_CLR			(FM3_CRG_BASE + 0x68)

#define SCM_CTL_MOSCE			0x02
#define SCM_CTL_SOSCE			0x08
#define SCM_CTL_PLLE			0x10
#define SCM_CTL_RCS_			0xe0
#define SCM_STR_MORDY			0x02
#define SCM_STR_SORDY			0x08
#define SCM_STR_PLRDY			0x10
#define SCM_STR_RCM				0xe0
#define APBC1_PSR_APBC1RST		0x10
#define APBC1_PSR_APBC1EN		0x80
#define APBC2_PSR_APBC2RST		0x10
#define APBC2_PSR_APBC2EN		0x80
#define SWC_PSR_TESTB			0x80
#define PSW_TMR_PINC			0x10

#define FM3_HWWDT_WDG_LDR		(FM3_HWWDT_BASE + 0x000)
#define FM3_HWWDT_WDG_VLR		(FM3_HWWDT_BASE + 0x004)
#define FM3_HWWDT_WDG_CTL		(FM3_HWWDT_BASE + 0x008)
#define FM3_HWWDT_WDG_ICL		(FM3_HWWDT_BASE + 0x00C)
#define FM3_HWWDT_WDG_RIS		(FM3_HWWDT_BASE + 0x010)
#define FM3_HWWDT_WDG_LCK		(FM3_HWWDT_BASE + 0xC00)

#define FM3_BT_CH0				(FM3_BT_BASE + 0x000)
#define FM3_BT_CH1				(FM3_BT_BASE + 0x040)
#define FM3_BT_CH2				(FM3_BT_BASE + 0x080)
#define FM3_BT_CH3				(FM3_BT_BASE + 0x0C0)
#define FM3_BT_BTSEL0123		(FM3_BT_BASE + 0x101)
#define FM3_BT_CH4				(FM3_BT_BASE + 0x200)
#define FM3_BT_CH5				(FM3_BT_BASE + 0x240)
#define FM3_BT_CH6				(FM3_BT_BASE + 0x280)
#define FM3_BT_CH7				(FM3_BT_BASE + 0x2C0)
#define FM3_BT_BTSEL4567		(FM3_BT_BASE + 0x301)
#define FM3_BT_CH8				(FM3_BT_BASE + 0x400)
#define FM3_BT_CH9				(FM3_BT_BASE + 0x440)
#define FM3_BT_CHA				(FM3_BT_BASE + 0x480)
#define FM3_BT_CHB				(FM3_BT_BASE + 0x4C0)
#define FM3_BT_BTSEL89AB		(FM3_BT_BASE + 0x501)
#define FM3_BT_CHC				(FM3_BT_BASE + 0x600)
#define FM3_BT_CHD				(FM3_BT_BASE + 0x640)
#define FM3_BT_CHE				(FM3_BT_BASE + 0x680)
#define FM3_BT_CHF				(FM3_BT_BASE + 0x6C0)
#define FM3_BT_BTSELCDEF		(FM3_BT_BASE + 0x701)
#define FM3_BT_BTSSSR			(FM3_BT_BASE + 0xFFC)

