morioka/lwip_asp-linux/lwip_asp/asp/target/cq_frk_fm3_gcc/fm3_mb9bxxx.h
#define FM3_BT0_PCSR			(FM3_BT_CH0 + 0x00)
#define FM3_BT0_PDUT			(FM3_BT_CH0 + 0x04)
#define FM3_BT0_TMR				(FM3_BT_CH0 + 0x08)
#define FM3_BT0_TMCR			(FM3_BT_CH0 + 0x0C)
#define FM3_BT0_STC				(FM3_BT_CH0 + 0x10)
#define FM3_BT0_TMCR2			(FM3_BT_CH0 + 0x11)
#define FM3_BT1_PCSR			(FM3_BT_CH1 + 0x00)
#define FM3_BT1_PDUT			(FM3_BT_CH1 + 0x04)
#define FM3_BT1_TMR				(FM3_BT_CH1 + 0x08)
#define FM3_BT1_TMCR			(FM3_BT_CH1 + 0x0C)
#define FM3_BT1_STC				(FM3_BT_CH1 + 0x10)
#define FM3_BT1_TMCR2			(FM3_BT_CH1 + 0x11)
#define FM3_BT2_PCSR			(FM3_BT_CH2 + 0x00)
#define FM3_BT2_PDUT			(FM3_BT_CH2 + 0x04)
#define FM3_BT2_TMR				(FM3_BT_CH2 + 0x08)
#define FM3_BT2_TMCR			(FM3_BT_CH2 + 0x0C)
#define FM3_BT2_STC				(FM3_BT_CH2 + 0x10)
#define FM3_BT2_TMCR2			(FM3_BT_CH2 + 0x11)
#define FM3_BT3_PCSR			(FM3_BT_CH3 + 0x00)
#define FM3_BT3_PDUT			(FM3_BT_CH3 + 0x04)
#define FM3_BT3_TMR				(FM3_BT_CH3 + 0x08)
#define FM3_BT3_TMCR			(FM3_BT_CH3 + 0x0C)
#define FM3_BT3_STC				(FM3_BT_CH3 + 0x10)
#define FM3_BT3_TMCR2			(FM3_BT_CH3 + 0x11)
#define FM3_BT4_PCSR			(FM3_BT_CH4 + 0x00)
#define FM3_BT4_PDUT			(FM3_BT_CH4 + 0x04)
#define FM3_BT4_TMR				(FM3_BT_CH4 + 0x08)
#define FM3_BT4_TMCR			(FM3_BT_CH4 + 0x0C)
#define FM3_BT4_STC				(FM3_BT_CH4 + 0x10)
#define FM3_BT4_TMCR2			(FM3_BT_CH4 + 0x11)
#define FM3_BT5_PCSR			(FM3_BT_CH5 + 0x00)
#define FM3_BT5_PDUT			(FM3_BT_CH5 + 0x04)
#define FM3_BT5_TMR				(FM3_BT_CH5 + 0x08)
#define FM3_BT5_TMCR			(FM3_BT_CH5 + 0x0C)
#define FM3_BT5_STC				(FM3_BT_CH5 + 0x10)
#define FM3_BT5_TMCR2			(FM3_BT_CH5 + 0x11)
#define FM3_BT6_PCSR			(FM3_BT_CH6 + 0x00)
#define FM3_BT6_PDUT			(FM3_BT_CH6 + 0x04)
#define FM3_BT6_TMR				(FM3_BT_CH6 + 0x08)
#define FM3_BT6_TMCR			(FM3_BT_CH6 + 0x0C)
#define FM3_BT6_STC				(FM3_BT_CH6 + 0x10)
#define FM3_BT6_TMCR2			(FM3_BT_CH6 + 0x11)
#define FM3_BT7_PCSR			(FM3_BT_CH7 + 0x00)
#define FM3_BT7_PDUT			(FM3_BT_CH7 + 0x04)
#define FM3_BT7_TMR				(FM3_BT_CH7 + 0x08)
#define FM3_BT7_TMCR			(FM3_BT_CH7 + 0x0C)
#define FM3_BT7_STC				(FM3_BT_CH7 + 0x10)
#define FM3_BT7_TMCR2			(FM3_BT_CH7 + 0x11)
#define FM3_BT8_PCSR			(FM3_BT_CH8 + 0x00)
#define FM3_BT8_PDUT			(FM3_BT_CH8 + 0x04)
#define FM3_BT8_TMR				(FM3_BT_CH8 + 0x08)
#define FM3_BT8_TMCR			(FM3_BT_CH8 + 0x0C)
#define FM3_BT8_STC				(FM3_BT_CH8 + 0x10)
#define FM3_BT8_TMCR2			(FM3_BT_CH8 + 0x11)
#define FM3_BT9_PCSR			(FM3_BT_CH9 + 0x00)
#define FM3_BT9_PDUT			(FM3_BT_CH9 + 0x04)
#define FM3_BT9_TMR				(FM3_BT_CH9 + 0x08)
#define FM3_BT9_TMCR			(FM3_BT_CH9 + 0x0C)
#define FM3_BT9_STC				(FM3_BT_CH9 + 0x10)
#define FM3_BT9_TMCR2			(FM3_BT_CH9 + 0x11)
#define FM3_BT10_PCSR			(FM3_BT_CHA + 0x00)
#define FM3_BT10_PDUT			(FM3_BT_CHA + 0x04)
#define FM3_BT10_TMR			(FM3_BT_CHA + 0x08)
#define FM3_BT10_TMCR			(FM3_BT_CHA + 0x0C)
#define FM3_BT10_STC			(FM3_BT_CHA + 0x10)
#define FM3_BT10_TMCR2			(FM3_BT_CHA + 0x11)
#define FM3_BT11_PCSR			(FM3_BT_CHB + 0x00)
#define FM3_BT11_PDUT			(FM3_BT_CHB + 0x04)
#define FM3_BT11_TMR			(FM3_BT_CHB + 0x08)
#define FM3_BT11_TMCR			(FM3_BT_CHB + 0x0C)
#define FM3_BT11_STC			(FM3_BT_CHB + 0x10)
#define FM3_BT11_TMCR2			(FM3_BT_CHB + 0x11)
#define FM3_BT12_PCSR			(FM3_BT_CHC + 0x00)
#define FM3_BT12_PDUT			(FM3_BT_CHC + 0x04)
#define FM3_BT12_TMR			(FM3_BT_CHC + 0x08)
#define FM3_BT12_TMCR			(FM3_BT_CHC + 0x0C)
#define FM3_BT12_STC			(FM3_BT_CHC + 0x10)
#define FM3_BT12_TMCR2			(FM3_BT_CHC + 0x11)
#define FM3_BT13_PCSR			(FM3_BT_CHD + 0x00)
#define FM3_BT13_PDUT			(FM3_BT_CHD + 0x04)
#define FM3_BT13_TMR			(FM3_BT_CHD + 0x08)
#define FM3_BT13_TMCR			(FM3_BT_CHD + 0x0C)
#define FM3_BT13_STC			(FM3_BT_CHD + 0x10)
#define FM3_BT13_TMCR2			(FM3_BT_CHD + 0x11)
#define FM3_BT14_PCSR			(FM3_BT_CHE + 0x00)
#define FM3_BT14_PDUT			(FM3_BT_CHE + 0x04)
#define FM3_BT14_TMR			(FM3_BT_CHE + 0x08)
#define FM3_BT14_TMCR			(FM3_BT_CHE + 0x0C)
#define FM3_BT14_STC			(FM3_BT_CHE + 0x10)
#define FM3_BT14_TMCR2			(FM3_BT_CHE + 0x11)
#define FM3_BT15_PCSR			(FM3_BT_CHF + 0x00)
#define FM3_BT15_PDUT			(FM3_BT_CHF + 0x04)
#define FM3_BT15_TMR			(FM3_BT_CHF + 0x08)
#define FM3_BT15_TMCR			(FM3_BT_CHF + 0x0C)
#define FM3_BT15_STC			(FM3_BT_CHF + 0x10)
#define FM3_BT15_TMCR2			(FM3_BT_CHF + 0x11)

#define FM3_ADC0_ADSR			(FM3_ADC0_BASE + 0x00)
#define FM3_ADC0_ADCR			(FM3_ADC0_BASE + 0x01)
#define FM3_ADC0_SFNS			(FM3_ADC0_BASE + 0x08)
#define FM3_ADC0_SCCR			(FM3_ADC0_BASE + 0x09)
#define FM3_ADC0_SCFD			(FM3_ADC0_BASE + 0x0c)
#define FM3_ADC0_SCIS23			(FM3_ADC0_BASE + 0x10)
#define FM3_ADC0_SCIS01			(FM3_ADC0_BASE + 0x14)
#define FM3_ADC0_PFNS			(FM3_ADC0_BASE + 0x18)
#define FM3_ADC0_PCCR			(FM3_ADC0_BASE + 0x19)
#define FM3_ADC0_PCFD			(FM3_ADC0_BASE + 0x1c)
#define FM3_ADC0_PCIS			(FM3_ADC0_BASE + 0x20)
#define FM3_ADC0_CMPCR			(FM3_ADC0_BASE + 0x24)
#define FM3_ADC0_CMPD			(FM3_ADC0_BASE + 0x26)
#define FM3_ADC0_ADSS23			(FM3_ADC0_BASE + 0x28)
#define FM3_ADC0_ADSS01			(FM3_ADC0_BASE + 0x2c)
#define FM3_ADC0_ADST1			(FM3_ADC0_BASE + 0x30)
#define FM3_ADC0_ADST0			(FM3_ADC0_BASE + 0x31)
#define FM3_ADC0_ADCT			(FM3_ADC0_BASE + 0x34)
#define FM3_ADC0_PRTSL			(FM3_ADC0_BASE + 0x38)
#define FM3_ADC0_SCTSL			(FM3_ADC0_BASE + 0x39)
#define FM3_ADC0_ADCEN			(FM3_ADC0_BASE + 0x3c)
#define FM3_ADC1_ADSR			(FM3_ADC1_BASE + 0x00)
#define FM3_ADC1_ADCR			(FM3_ADC1_BASE + 0x01)
#define FM3_ADC1_SFNS			(FM3_ADC1_BASE + 0x08)
#define FM3_ADC1_SCCR			(FM3_ADC1_BASE + 0x09)
#define FM3_ADC1_SCFD			(FM3_ADC1_BASE + 0x0c)
#define FM3_ADC1_SCIS23			(FM3_ADC1_BASE + 0x10)
#define FM3_ADC1_SCIS01			(FM3_ADC1_BASE + 0x14)
#define FM3_ADC1_PFNS			(FM3_ADC1_BASE + 0x18)
#define FM3_ADC1_PCCR			(FM3_ADC1_BASE + 0x19)
#define FM3_ADC1_PCFD			(FM3_ADC1_BASE + 0x1c)
#define FM3_ADC1_PCIS			(FM3_ADC1_BASE + 0x20)
#define FM3_ADC1_CMPCR			(FM3_ADC1_BASE + 0x24)
#define FM3_ADC1_CMPD			(FM3_ADC1_BASE + 0x26)
#define FM3_ADC1_ADSS23			(FM3_ADC1_BASE + 0x28)
#define FM3_ADC1_ADSS01			(FM3_ADC1_BASE + 0x2c)
#define FM3_ADC1_ADST1			(FM3_ADC1_BASE + 0x30)
#define FM3_ADC1_ADST0			(FM3_ADC1_BASE + 0x31)
#define FM3_ADC1_ADCT			(FM3_ADC1_BASE + 0x34)
#define FM3_ADC1_PRTSL			(FM3_ADC1_BASE + 0x38)
#define FM3_ADC1_SCTSL			(FM3_ADC1_BASE + 0x39)
#define FM3_ADC1_ADCEN			(FM3_ADC1_BASE + 0x3c)
#define FM3_ADC2_ADSR			(FM3_ADC2_BASE + 0x00)
#define FM3_ADC2_ADCR			(FM3_ADC2_BASE + 0x01)
#define FM3_ADC2_SFNS			(FM3_ADC2_BASE + 0x08)
#define FM3_ADC2_SCCR			(FM3_ADC2_BASE + 0x09)
#define FM3_ADC2_SCFD			(FM3_ADC2_BASE + 0x0c)
#define FM3_ADC2_SCIS23			(FM3_ADC2_BASE + 0x10)
#define FM3_ADC2_SCIS01			(FM3_ADC2_BASE + 0x14)
#define FM3_ADC2_PFNS			(FM3_ADC2_BASE + 0x18)
#define FM3_ADC2_PCCR			(FM3_ADC2_BASE + 0x19)
#define FM3_ADC2_PCFD			(FM3_ADC2_BASE + 0x1c)
#define FM3_ADC2_PCIS			(FM3_ADC2_BASE + 0x20)
#define FM3_ADC2_CMPCR			(FM3_ADC2_BASE + 0x24)
#define FM3_ADC2_CMPD			(FM3_ADC2_BASE + 0x26)
#define FM3_ADC2_ADSS23			(FM3_ADC2_BASE + 0x28)
#define FM3_ADC2_ADSS01			(FM3_ADC2_BASE + 0x2c)
#define FM3_ADC2_ADST1			(FM3_ADC2_BASE + 0x30)
#define FM3_ADC2_ADST0			(FM3_ADC2_BASE + 0x31)
#define FM3_ADC2_ADCT			(FM3_ADC2_BASE + 0x34)
#define FM3_ADC2_PRTSL			(FM3_ADC2_BASE + 0x38)
#define FM3_ADC2_SCTSL			(FM3_ADC2_BASE + 0x39)
#define FM3_ADC2_ADCEN			(FM3_ADC2_BASE + 0x3c)

#define FM3_CRTRIM_MCR_PSR		(FM3_CRTRIM_BASE + 0x00)
#define FM3_CRTRIM_MCR_FTRM		(FM3_CRTRIM_BASE + 0x04)
#define FM3_CRTRIM_MCR_RLR		(FM3_CRTRIM_BASE + 0x0C)

