morioka/lwip_asp-linux/lwip_asp/asp/target/cq_frk_fm3_gcc/fm3_mb9bxxx.h
#define FM3_EXTI_ENIR			(FM3_EXTI_BASE + 0x00)
#define FM3_EXTI_EIRR			(FM3_EXTI_BASE + 0x04)
#define FM3_EXTI_EICL			(FM3_EXTI_BASE + 0x08)
#define FM3_EXTI_ELVR			(FM3_EXTI_BASE + 0x0C)
#define FM3_EXTI_ELVR1			(FM3_EXTI_BASE + 0x10)
#define FM3_EXTI_NMIRR			(FM3_EXTI_BASE + 0x14)
#define FM3_EXTI_NMICL			(FM3_EXTI_BASE + 0x18)

#define FM3_INTREQ_DRQSEL		(FM3_INTREQ_BASE + 0x000)
#define FM3_INTREQ_ODDPKS		(FM3_INTREQ_BASE + 0x00B)
#define FM3_INTREQ_EXC02MON		(FM3_INTREQ_BASE + 0x010)
#define FM3_INTREQ_IRQ00MON		(FM3_INTREQ_BASE + 0x014)
#define FM3_INTREQ_IRQ01MON		(FM3_INTREQ_BASE + 0x018)
#define FM3_INTREQ_IRQ02MON		(FM3_INTREQ_BASE + 0x01C)
#define FM3_INTREQ_IRQ03MON		(FM3_INTREQ_BASE + 0x020)
#define FM3_INTREQ_IRQ04MON		(FM3_INTREQ_BASE + 0x024)
#define FM3_INTREQ_IRQ05MON		(FM3_INTREQ_BASE + 0x028)
#define FM3_INTREQ_IRQ06MON		(FM3_INTREQ_BASE + 0x02C)
#define FM3_INTREQ_IRQ07MON		(FM3_INTREQ_BASE + 0x030)
#define FM3_INTREQ_IRQ08MON		(FM3_INTREQ_BASE + 0x034)
#define FM3_INTREQ_IRQ09MON		(FM3_INTREQ_BASE + 0x038)
#define FM3_INTREQ_IRQ10MON		(FM3_INTREQ_BASE + 0x03C)
#define FM3_INTREQ_IRQ11MON		(FM3_INTREQ_BASE + 0x040)
#define FM3_INTREQ_IRQ12MON		(FM3_INTREQ_BASE + 0x044)
#define FM3_INTREQ_IRQ13MON		(FM3_INTREQ_BASE + 0x048)
#define FM3_INTREQ_IRQ14MON		(FM3_INTREQ_BASE + 0x04C)
#define FM3_INTREQ_IRQ15MON		(FM3_INTREQ_BASE + 0x050)
#define FM3_INTREQ_IRQ16MON		(FM3_INTREQ_BASE + 0x054)
#define FM3_INTREQ_IRQ17MON		(FM3_INTREQ_BASE + 0x058)
#define FM3_INTREQ_IRQ18MON		(FM3_INTREQ_BASE + 0x05C)
#define FM3_INTREQ_IRQ19MON		(FM3_INTREQ_BASE + 0x060)
#define FM3_INTREQ_IRQ20MON		(FM3_INTREQ_BASE + 0x064)
#define FM3_INTREQ_IRQ21MON		(FM3_INTREQ_BASE + 0x068)
#define FM3_INTREQ_IRQ22MON		(FM3_INTREQ_BASE + 0x06C)
#define FM3_INTREQ_IRQ23MON		(FM3_INTREQ_BASE + 0x070)
#define FM3_INTREQ_IRQ24MON		(FM3_INTREQ_BASE + 0x074)
#define FM3_INTREQ_IRQ25MON		(FM3_INTREQ_BASE + 0x078)
#define FM3_INTREQ_IRQ26MON		(FM3_INTREQ_BASE + 0x07C)
#define FM3_INTREQ_IRQ27MON		(FM3_INTREQ_BASE + 0x080)
#define FM3_INTREQ_IRQ28MON		(FM3_INTREQ_BASE + 0x084)
#define FM3_INTREQ_IRQ29MON		(FM3_INTREQ_BASE + 0x088)
#define FM3_INTREQ_IRQ30MON		(FM3_INTREQ_BASE + 0x08C)
#define FM3_INTREQ_IRQ31MON		(FM3_INTREQ_BASE + 0x090)
#define FM3_INTREQ_IRQ32MON		(FM3_INTREQ_BASE + 0x094)
#define FM3_INTREQ_IRQ33MON		(FM3_INTREQ_BASE + 0x098)
#define FM3_INTREQ_IRQ34MON		(FM3_INTREQ_BASE + 0x09C)
#define FM3_INTREQ_IRQ35MON		(FM3_INTREQ_BASE + 0x0A0)
#define FM3_INTREQ_IRQ36MON		(FM3_INTREQ_BASE + 0x0A4)
#define FM3_INTREQ_IRQ37MON		(FM3_INTREQ_BASE + 0x0A8)
#define FM3_INTREQ_IRQ38MON		(FM3_INTREQ_BASE + 0x0AC)
#define FM3_INTREQ_IRQ39MON		(FM3_INTREQ_BASE + 0x0B0)
#define FM3_INTREQ_IRQ40MON		(FM3_INTREQ_BASE + 0x0B4)
#define FM3_INTREQ_IRQ41MON		(FM3_INTREQ_BASE + 0x0B8)
#define FM3_INTREQ_IRQ42MON		(FM3_INTREQ_BASE + 0x0BC)
#define FM3_INTREQ_IRQ43MON		(FM3_INTREQ_BASE + 0x0C0)
#define FM3_INTREQ_IRQ44MON		(FM3_INTREQ_BASE + 0x0C4)
#define FM3_INTREQ_IRQ45MON		(FM3_INTREQ_BASE + 0x0C8)
#define FM3_INTREQ_IRQ46MON		(FM3_INTREQ_BASE + 0x0CC)
#define FM3_INTREQ_IRQ47MON		(FM3_INTREQ_BASE + 0x0D0)
#define FM3_INTREQ_DRQSEL1		(FM3_INTREQ_BASE + 0x200)
#define FM3_INTREQ_DQESEL		(FM3_INTREQ_BASE + 0x204)
#define FM3_INTREQ_ODDPKS1		(FM3_INTREQ_BASE + 0x20F)

#define FM3_GPIO_PFR			(FM3_GPIO_BASE + 0x000)
#define FM3_GPIO_PFR0			(FM3_GPIO_PFR + 0x00)
#define FM3_GPIO_PFR1			(FM3_GPIO_PFR + 0x04)
#define FM3_GPIO_PFR2			(FM3_GPIO_PFR + 0x08)
#define FM3_GPIO_PFR3			(FM3_GPIO_PFR + 0x0C)
#define FM3_GPIO_PFR4			(FM3_GPIO_PFR + 0x10)
#define FM3_GPIO_PFR5			(FM3_GPIO_PFR + 0x14)
#define FM3_GPIO_PFR6			(FM3_GPIO_PFR + 0x18)
#define FM3_GPIO_PFR7			(FM3_GPIO_PFR + 0x1C)
#define FM3_GPIO_PFR8			(FM3_GPIO_PFR + 0x20)
#define FM3_GPIO_PFR9			(FM3_GPIO_PFR + 0x24)
#define FM3_GPIO_PFRA			(FM3_GPIO_PFR + 0x28)
#define FM3_GPIO_PFRB			(FM3_GPIO_PFR + 0x2C)
#define FM3_GPIO_PFRC			(FM3_GPIO_PFR + 0x30)
#define FM3_GPIO_PFRD			(FM3_GPIO_PFR + 0x34)
#define FM3_GPIO_PFRE			(FM3_GPIO_PFR + 0x38)
#define FM3_GPIO_PFRF			(FM3_GPIO_PFR + 0x3C)
#define FM3_GPIO_PCR			(FM3_GPIO_BASE + 0x100)
#define FM3_GPIO_PCR0			(FM3_GPIO_PCR + 0x00)
#define FM3_GPIO_PCR1			(FM3_GPIO_PCR + 0x04)
#define FM3_GPIO_PCR2			(FM3_GPIO_PCR + 0x08)
#define FM3_GPIO_PCR3			(FM3_GPIO_PCR + 0x0C)
#define FM3_GPIO_PCR4			(FM3_GPIO_PCR + 0x10)
#define FM3_GPIO_PCR5			(FM3_GPIO_PCR + 0x14)
#define FM3_GPIO_PCR6			(FM3_GPIO_PCR + 0x18)
#define FM3_GPIO_PCR7			(FM3_GPIO_PCR + 0x1C)
#define FM3_GPIO_PCR8			(FM3_GPIO_PCR + 0x20)
#define FM3_GPIO_PCR9			(FM3_GPIO_PCR + 0x24)
#define FM3_GPIO_PCRA			(FM3_GPIO_PCR + 0x28)
#define FM3_GPIO_PCRB			(FM3_GPIO_PCR + 0x2C)
#define FM3_GPIO_PCRC			(FM3_GPIO_PCR + 0x30)
#define FM3_GPIO_PCRD			(FM3_GPIO_PCR + 0x34)
#define FM3_GPIO_PCRE			(FM3_GPIO_PCR + 0x38)
#define FM3_GPIO_PCRF			(FM3_GPIO_PCR + 0x3C)
#define FM3_GPIO_DDR			(FM3_GPIO_BASE + 0x200)
#define FM3_GPIO_DDR0			(FM3_GPIO_DDR + 0x00)
#define FM3_GPIO_DDR1			(FM3_GPIO_DDR + 0x04)
#define FM3_GPIO_DDR2			(FM3_GPIO_DDR + 0x08)
#define FM3_GPIO_DDR3			(FM3_GPIO_DDR + 0x0C)
#define FM3_GPIO_DDR4			(FM3_GPIO_DDR + 0x10)
#define FM3_GPIO_DDR5			(FM3_GPIO_DDR + 0x14)
#define FM3_GPIO_DDR6			(FM3_GPIO_DDR + 0x18)
#define FM3_GPIO_DDR7			(FM3_GPIO_DDR + 0x1C)
#define FM3_GPIO_DDR8			(FM3_GPIO_DDR + 0x20)
#define FM3_GPIO_DDR9			(FM3_GPIO_DDR + 0x24)
#define FM3_GPIO_DDRA			(FM3_GPIO_DDR + 0x28)
#define FM3_GPIO_DDRB			(FM3_GPIO_DDR + 0x2C)
#define FM3_GPIO_DDRC			(FM3_GPIO_DDR + 0x30)
#define FM3_GPIO_DDRD			(FM3_GPIO_DDR + 0x34)
#define FM3_GPIO_DDRE			(FM3_GPIO_DDR + 0x38)
#define FM3_GPIO_DDRF			(FM3_GPIO_DDR + 0x3C)
#define FM3_GPIO_PDIR			(FM3_GPIO_BASE + 0x300)
#define FM3_GPIO_PDIR0			(FM3_GPIO_PDIR + 0x00)
#define FM3_GPIO_PDIR1			(FM3_GPIO_PDIR + 0x04)
#define FM3_GPIO_PDIR2			(FM3_GPIO_PDIR + 0x08)
#define FM3_GPIO_PDIR3			(FM3_GPIO_PDIR + 0x0C)
#define FM3_GPIO_PDIR4			(FM3_GPIO_PDIR + 0x10)
#define FM3_GPIO_PDIR5			(FM3_GPIO_PDIR + 0x14)
#define FM3_GPIO_PDIR6			(FM3_GPIO_PDIR + 0x18)
#define FM3_GPIO_PDIR7			(FM3_GPIO_PDIR + 0x1C)
#define FM3_GPIO_PDIR8			(FM3_GPIO_PDIR + 0x20)
#define FM3_GPIO_PDIR9			(FM3_GPIO_PDIR + 0x24)
#define FM3_GPIO_PDIRA			(FM3_GPIO_PDIR + 0x28)
#define FM3_GPIO_PDIRB			(FM3_GPIO_PDIR + 0x2C)
#define FM3_GPIO_PDIRC			(FM3_GPIO_PDIR + 0x30)
#define FM3_GPIO_PDIRD			(FM3_GPIO_PDIR + 0x34)
#define FM3_GPIO_PDIRE			(FM3_GPIO_PDIR + 0x38)
#define FM3_GPIO_PDIRF			(FM3_GPIO_PDIR + 0x3C)
#define FM3_GPIO_PDOR			(FM3_GPIO_BASE + 0x400)
#define FM3_GPIO_PDOR0			(FM3_GPIO_PDOR + 0x00)
#define FM3_GPIO_PDOR1			(FM3_GPIO_PDOR + 0x04)
#define FM3_GPIO_PDOR2			(FM3_GPIO_PDOR + 0x08)
#define FM3_GPIO_PDOR3			(FM3_GPIO_PDOR + 0x0C)
#define FM3_GPIO_PDOR4			(FM3_GPIO_PDOR + 0x10)
#define FM3_GPIO_PDOR5			(FM3_GPIO_PDOR + 0x14)
#define FM3_GPIO_PDOR6			(FM3_GPIO_PDOR + 0x18)
#define FM3_GPIO_PDOR7			(FM3_GPIO_PDOR + 0x1C)
#define FM3_GPIO_PDOR8			(FM3_GPIO_PDOR + 0x20)
#define FM3_GPIO_PDOR9			(FM3_GPIO_PDOR + 0x24)
#define FM3_GPIO_PDORA			(FM3_GPIO_PDOR + 0x28)
#define FM3_GPIO_PDORB			(FM3_GPIO_PDOR + 0x2C)
#define FM3_GPIO_PDORC			(FM3_GPIO_PDOR + 0x30)
#define FM3_GPIO_PDORD			(FM3_GPIO_PDOR + 0x34)
#define FM3_GPIO_PDORE			(FM3_GPIO_PDOR + 0x38)
#define FM3_GPIO_PDORF			(FM3_GPIO_PDOR + 0x3C)
#define FM3_GPIO_ADE			(FM3_GPIO_BASE + 0x500)
#define FM3_GPIO_EPFR			(FM3_GPIO_BASE + 0x600)
#define FM3_GPIO_EPFR00			(FM3_GPIO_EPFR + 0x00)
#define FM3_GPIO_EPFR01			(FM3_GPIO_EPFR + 0x04)
#define FM3_GPIO_EPFR02			(FM3_GPIO_EPFR + 0x08)
#define FM3_GPIO_EPFR03			(FM3_GPIO_EPFR + 0x0C)
#define FM3_GPIO_EPFR04			(FM3_GPIO_EPFR + 0x10)
#define FM3_GPIO_EPFR05			(FM3_GPIO_EPFR + 0x14)
#define FM3_GPIO_EPFR06			(FM3_GPIO_EPFR + 0x18)
#define FM3_GPIO_EPFR07			(FM3_GPIO_EPFR + 0x1C)
#define FM3_GPIO_EPFR08			(FM3_GPIO_EPFR + 0x20)
#define FM3_GPIO_EPFR09			(FM3_GPIO_EPFR + 0x24)
#define FM3_GPIO_EPFR10			(FM3_GPIO_EPFR + 0x28)
#define FM3_GPIO_EPFR11			(FM3_GPIO_EPFR + 0x2C)
#define FM3_GPIO_EPFR12			(FM3_GPIO_EPFR + 0x30)
#define FM3_GPIO_EPFR13			(FM3_GPIO_EPFR + 0x34)
#define FM3_GPIO_EPFR14			(FM3_GPIO_EPFR + 0x38)
#define FM3_GPIO_EPFR15			(FM3_GPIO_EPFR + 0x3C)
#define FM3_GPIO_PZR			(FM3_GPIO_BASE + 0x700)
#define FM3_GPIO_PZR0			(FM3_GPIO_PZR + 0x00)
#define FM3_GPIO_PZR1			(FM3_GPIO_PZR + 0x04)
#define FM3_GPIO_PZR2			(FM3_GPIO_PZR + 0x08)
#define FM3_GPIO_PZR3			(FM3_GPIO_PZR + 0x0C)
#define FM3_GPIO_PZR4			(FM3_GPIO_PZR + 0x10)
#define FM3_GPIO_PZR5			(FM3_GPIO_PZR + 0x14)
#define FM3_GPIO_PZR6			(FM3_GPIO_PZR + 0x18)
#define FM3_GPIO_PZR7			(FM3_GPIO_PZR + 0x1C)
#define FM3_GPIO_PZR8			(FM3_GPIO_PZR + 0x20)
#define FM3_GPIO_PZR9			(FM3_GPIO_PZR + 0x24)
#define FM3_GPIO_PZRA			(FM3_GPIO_PZR + 0x28)
#define FM3_GPIO_PZRB			(FM3_GPIO_PZR + 0x2C)
#define FM3_GPIO_PZRC			(FM3_GPIO_PZR + 0x30)
#define FM3_GPIO_PZRD			(FM3_GPIO_PZR + 0x34)
#define FM3_GPIO_PZRE			(FM3_GPIO_PZR + 0x38)
#define FM3_GPIO_PZRF			(FM3_GPIO_PZR + 0x3C)

