morioka/lwip_asp-linux/lwip_asp/asp/target/cq_frk_fm3_gcc/fm3_mb9bxxx.h
/*
 *  FM3_MFSx Register Bit Definition
 */
#define SMR_SOE					0x01U
#define SMR_BDS					0x04U
#define SMR_SBL					0x08U
#define SMR_WUCR				0x10U
#define SMR_MD_UART				0x00U
#define SMR_MD_UART_MP			0x20U
#define SMR_MD_SIO				0x40U
#define SMR_MD_LIN				0x60U
#define SMR_MD_I2C				0x80U

#define SCR_TXE					0x01U
#define SCR_RXE					0x02U
#define SCR_TBIE				0x04U
#define SCR_TIE					0x08U
#define SCR_RIE					0x10U
#define SCR_UPCL				0x80U

#define SSR_TBI					0x01U
#define SSR_TDRE				0x02U
#define SSR_RDRF				0x04U
#define SSR_ORE					0x08U
#define SSR_FRE					0x10U
#define SSR_PE					0x20U
#define SSR_REC					0x80U

#define ESCR_P					0x08U
#define ESCR_PEN				0x10U
#define ESCR_INV				0x20U
#define ESCR_ESBL				0x40U
#define ESCR_FLWEN				0x80U
#define ESCR_DATABITS_8			0x00U
#define ESCR_DATABITS_5			0x01U
#define ESCR_DATABITS_6			0x02U
#define ESCR_DATABITS_7			0x03U
#define ESCR_DATABITS_9			0x04U

#define BGR_EXT					0x8000U

#define FM3_EXBUS_MODE			(FM3_EXTBUS_BASE + 0x000)
#define FM3_EXBUS_MODE0			(FM3_EXBUS_MODE + 0x00)
#define FM3_EXBUS_MODE1			(FM3_EXBUS_MODE + 0x04)
#define FM3_EXBUS_MODE2			(FM3_EXBUS_MODE + 0x08)
#define FM3_EXBUS_MODE3			(FM3_EXBUS_MODE + 0x0C)
#define FM3_EXBUS_MODE4			(FM3_EXBUS_MODE + 0x10)
#define FM3_EXBUS_MODE5			(FM3_EXBUS_MODE + 0x14)
#define FM3_EXBUS_MODE6			(FM3_EXBUS_MODE + 0x18)
#define FM3_EXBUS_MODE7			(FM3_EXBUS_MODE + 0x1C)
#define FM3_EXBUS_TIM			(FM3_EXTBUS_BASE + 0x020)
#define FM3_EXBUS_TIM0			(FM3_EXBUS_TIM + 0x00)
#define FM3_EXBUS_TIM1			(FM3_EXBUS_TIM + 0x04)
#define FM3_EXBUS_TIM2			(FM3_EXBUS_TIM + 0x08)
#define FM3_EXBUS_TIM3			(FM3_EXBUS_TIM + 0x0C)
#define FM3_EXBUS_TIM4			(FM3_EXBUS_TIM + 0x10)
#define FM3_EXBUS_TIM5			(FM3_EXBUS_TIM + 0x14)
#define FM3_EXBUS_TIM6			(FM3_EXBUS_TIM + 0x18)
#define FM3_EXBUS_TIM7			(FM3_EXBUS_TIM + 0x1C)
#define FM3_EXBUS_AREA			(FM3_EXTBUS_BASE + 0x040)
#define FM3_EXBUS_AREA0			(FM3_EXBUS_AREA + 0x00)
#define FM3_EXBUS_AREA1			(FM3_EXBUS_AREA + 0x04)
#define FM3_EXBUS_AREA2			(FM3_EXBUS_AREA + 0x08)
#define FM3_EXBUS_AREA3			(FM3_EXBUS_AREA + 0x0C)
#define FM3_EXBUS_AREA4			(FM3_EXBUS_AREA + 0x10)
#define FM3_EXBUS_AREA5			(FM3_EXBUS_AREA + 0x14)
#define FM3_EXBUS_AREA6			(FM3_EXBUS_AREA + 0x18)
#define FM3_EXBUS_AREA7			(FM3_EXBUS_AREA + 0x1C)
#define FM3_EXBUS_ATIM			(FM3_EXTBUS_BASE + 0x060)
#define FM3_EXBUS_ATIM0			(FM3_EXBUS_ATIM + 0x00)
#define FM3_EXBUS_ATIM1			(FM3_EXBUS_ATIM + 0x04)
#define FM3_EXBUS_ATIM2			(FM3_EXBUS_ATIM + 0x08)
#define FM3_EXBUS_ATIM3			(FM3_EXBUS_ATIM + 0x0C)
#define FM3_EXBUS_ATIM4			(FM3_EXBUS_ATIM + 0x10)
#define FM3_EXBUS_ATIM5			(FM3_EXBUS_ATIM + 0x14)
#define FM3_EXBUS_ATIM6			(FM3_EXBUS_ATIM + 0x18)
#define FM3_EXBUS_ATIM7			(FM3_EXBUS_ATIM + 0x1C)
#define FM3_EXBUS_DCLKR			(FM3_EXTBUS_BASE + 0x300)

#define FM3_DMAC_DMACR			(FM3_DMAC_BASE + 0x000)
#define FM3_DMAC0_BASE			(FM3_DMAC_BASE + 0x010)
#define FM3_DMAC_DMACA0			(FM3_DMAC0_BASE + 0x00)
#define FM3_DMAC_DMACB0			(FM3_DMAC0_BASE + 0x04)
#define FM3_DMAC_DMACSA0		(FM3_DMAC0_BASE + 0x08)
#define FM3_DMAC_DMACDA0		(FM3_DMAC0_BASE + 0x0C)
#define FM3_DMAC1_BASE			(FM3_DMAC_BASE + 0x020)
#define FM3_DMAC_DMACA1			(FM3_DMAC1_BASE + 0x00)
#define FM3_DMAC_DMACB1			(FM3_DMAC1_BASE + 0x04)
#define FM3_DMAC_DMACSA1		(FM3_DMAC1_BASE + 0x08)
#define FM3_DMAC_DMACDA1		(FM3_DMAC1_BASE + 0x0C)
#define FM3_DMAC2_BASE			(FM3_DMAC_BASE + 0x030)
#define FM3_DMAC_DMACA2			(FM3_DMAC2_BASE + 0x00)
#define FM3_DMAC_DMACB2			(FM3_DMAC2_BASE + 0x04)
#define FM3_DMAC_DMACSA2		(FM3_DMAC2_BASE + 0x08)
#define FM3_DMAC_DMACDA2		(FM3_DMAC2_BASE + 0x0C)
#define FM3_DMAC3_BASE			(FM3_DMAC_BASE + 0x040)
#define FM3_DMAC_DMACA3			(FM3_DMAC3_BASE + 0x00)
#define FM3_DMAC_DMACB3			(FM3_DMAC3_BASE + 0x04)
#define FM3_DMAC_DMACSA3		(FM3_DMAC3_BASE + 0x08)
#define FM3_DMAC_DMACDA3		(FM3_DMAC3_BASE + 0x0C)
#define FM3_DMAC4_BASE			(FM3_DMAC_BASE + 0x050)
#define FM3_DMAC_DMACA4			(FM3_DMAC4_BASE + 0x00)
#define FM3_DMAC_DMACB4			(FM3_DMAC4_BASE + 0x04)
#define FM3_DMAC_DMACSA4		(FM3_DMAC4_BASE + 0x08)
#define FM3_DMAC_DMACDA4		(FM3_DMAC4_BASE + 0x0C)
#define FM3_DMAC5_BASE			(FM3_DMAC_BASE + 0x060)
#define FM3_DMAC_DMACA5			(FM3_DMAC5_BASE + 0x00)
#define FM3_DMAC_DMACB5			(FM3_DMAC5_BASE + 0x04)
#define FM3_DMAC_DMACSA5		(FM3_DMAC5_BASE + 0x08)
#define FM3_DMAC_DMACDA5		(FM3_DMAC5_BASE + 0x0C)
#define FM3_DMAC6_BASE			(FM3_DMAC_BASE + 0x070)
#define FM3_DMAC_DMACA6			(FM3_DMAC6_BASE + 0x00)
#define FM3_DMAC_DMACB6			(FM3_DMAC6_BASE + 0x04)
#define FM3_DMAC_DMACSA6		(FM3_DMAC6_BASE + 0x08)
#define FM3_DMAC_DMACDA6		(FM3_DMAC6_BASE + 0x0C)
#define FM3_DMAC7_BASE			(FM3_DMAC_BASE + 0x080)
#define FM3_DMAC_DMACA7			(FM3_DMAC7_BASE + 0x00)
#define FM3_DMAC_DMACB7			(FM3_DMAC7_BASE + 0x04)
#define FM3_DMAC_DMACSA7		(FM3_DMAC7_BASE + 0x08)
#define FM3_DMAC_DMACDA7		(FM3_DMAC7_BASE + 0x0C)

#ifndef TOPPERS_MACRO_ONLY

#endif /* TOPPERS_MACRO_ONLY */

#endif /* TOPPERS_FM3_MB9BXXX_H */
